In [ ]:
=============EDA==============
1) pandas : Data frame applications

2) numpy : Numerical python All math applications 

3) matplotlib : used for plotting

4) seaborn : used for plot

5) plotly : use for plot

6) Bokhe  : use for plot

===========Machine learning==========
7) sickit-learn: sklearn

===========Deep learning============

8) Tensorflow : Google

9) Keras : Google

10) pytorch : facebook

==========NLP================

11) NLTK : Natural language tool kit

12) Scipy 

==========BERT===============

13) Transformers : Hugging face (Google)

==========Google models========

14) specific google packages

========== Azure ML==========
15) Azure package

=========GenAI=============

16) Gemini : Google

17) ChatGpt : OpenAI

========LangChain===========

18) LangChain packages

**Create a data frame using list**

$Step-1$

In [3]:
import pandas as pd
names=['ayus','avinash','akash']
pd.DataFrame()  # empty data frame will create no rows and no column

Empty DataFrame
Columns: []
Index: []

$Step-2$

In [8]:
names=['ayus','avinash','akash']
pd.DataFrame(names)

         0
0     ayus
1  avinash
2    akash

In [10]:
names=['ayus','avinash','akash']
age=[20,25,30]
pd.DataFrame(names,age)
# what is the first positional argument: data
# second positional argument: index

          0
20     ayus
25  avinash
30    akash

In [11]:
names=['ayus','avinash','akash']
age=[20,25,30]
pd.DataFrame(zip(names,age))

         0   1
0     ayus  20
1  avinash  25
2    akash  30

In [13]:
names=['ayus','avinash','akash']
age=[20,25,30]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0     ayus  20      hyd
1  avinash  25      blr
2    akash  30  chennai

$Step-3-columns$

In [15]:
names=['ayus','avinash','akash']
age=[20,25,30]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city),columns=['names','age','city'])

     names  age     city
0     ayus   20      hyd
1  avinash   25      blr
2    akash   30  chennai

In [16]:
names=['ayus','avinash','akash']
age=[20,25,30]
city=['hyd','blr','chennai']
MobNo=['12***','23***','34***']
pd.DataFrame(zip(names,age,city,MobNo),columns=['names','age','city','MobNo'])

     names  age     city  MobNo
0     ayus   20      hyd  12***
1  avinash   25      blr  23***
2    akash   30  chennai  34***

In [29]:
names=['ayus','avinash','akash']
age=[20,25,30]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['names','age','city']
df=pd.DataFrame(data,columns=cols)

$step-4$

**Add new column**

In [ ]:
- If you want to add new column

- First you need to check the numbert of rows in already existed data

- for example in above the dataframe has 3 rows

- you need to create a new list with 3 rows

- that list

In [30]:
job=['DS','DE','CS']
df['JOB']=job
df

     names  age     city JOB
0     ayus   20      hyd  DS
1  avinash   25      blr  DE
2    akash   30  chennai  CS

In [35]:
df['Age']=[50,60,70]
df

# create new column update new column both are same way

     names  age     city JOB  Age
0     ayus   35      hyd  DS   50
1  avinash   40      blr  DE   60
2    akash   45  chennai  CS   70

$step-6$

**Change index**

In [36]:
names=['ayus','avinash','akash']
age=[20,25,30]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['names','age','city']
idx=['A','B','C']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
A     ayus   20      hyd
B  avinash   25      blr
C    akash   30  chennai

In [37]:
names=['ayus','avinash','akash','Anvi']
age=[20,25,30,35]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['names','age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
A     ayus   20      hyd
B  avinash   25      blr
C    akash   30  chennai
D     Anvi   35   Mumbai

**Note**

- Number of list equal to Number of columns

- Number of values inside list equals to  **Number of rows**

- When you create the data all the list will be in same length

$Step-7$

**shape**

- Number of rows

- Number of columns

In [38]:
df.shape

# Matrix format

# 4 rows and 3 columns

print('The number of rows are:',df.shape[0])
print('The number of columns are:',df.shape[1])

The number of rows are: 4
The number of columns are: 3

$Step-8$

**Drop the column**

- In order to drop column we required 3 arguments

- Column name

    - The column name we need to mention

- axis

    - axis=0 **represent rows**

    - axis=1 **represent columns**

- inplace

    - we drop column means we are modifying the data frame

    - sothis modification we want to save in same variable or different variable

    - If you want to keep in the same variable the **inplace=True**

In [39]:
df

     names  age     city
A     ayus   20      hyd
B  avinash   25      blr
C    akash   30  chennai
D     Anvi   35   Mumbai

In [40]:
df.drop('city',
        axis=1,
        inplace=True)

In [41]:
df

     names  age
A     ayus   20
B  avinash   25
C    akash   30
D     Anvi   35

In [47]:
df1=df.drop('age',
       axis=1)

In [48]:
df

     names  age
A     ayus   20
B  avinash   25
C    akash   30
D     Anvi   35

In [49]:
df1

     names
A     ayus
B  avinash
C    akash
D     Anvi

In [58]:
names=['ayus','avinash','akash','Anvi']
age=[20,25,30,35]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['names','age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
A     ayus   20      hyd
B  avinash   25      blr
C    akash   30  chennai
D     Anvi   35   Mumbai

In [59]:
df.drop('age',axis=1,inplace=True)
df

     names     city
A     ayus      hyd
B  avinash      blr
C    akash  chennai
D     Anvi   Mumbai

$Step-9$

**Multiple columns**

In [64]:
names=['ayus','avinash','akash','Anvi']
age=[20,25,30,35]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['names','age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
A     ayus   20      hyd
B  avinash   25      blr
C    akash   30  chennai
D     Anvi   35   Mumbai

In [65]:
df.drop(['age','city'],axis=1,inplace=True)
df

     names
A     ayus
B  avinash
C    akash
D     Anvi

In [66]:
names=['ayus','avinash','akash','Anvi']
age=[20,25,30,35]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['names','age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  age     city
A     ayus   20      hyd
B  avinash   25      blr
C    akash   30  chennai
D     Anvi   35   Mumbai

In [67]:
df.drop('A',axis=0,inplace=True)
df

     names  age     city
B  avinash   25      blr
C    akash   30  chennai
D     Anvi   35   Mumbai

$Step-11$

**how to save the data frame**

- Generally data frames are two types 

- csv(comma seperated value)

- excel

In [70]:
# file name=data
# extension=.csv
df.to_csv('data')
df.to_csv('data1.csv',index=False)

In [71]:
df.to_excel('data2.xlsx')